2026/ROSS_AAA/AAA_M_70-79_stat_1_prob_distribution_parabolic_morph_1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-35.595379 -25.412751 -48.149395)
    (69.607737 -25.412751 -48.149395)
    (69.607737 153.297975 -48.149395)
    (-35.595379 153.297975 -48.149395)
    (-35.595379 -25.412751 50.467989)
    (69.607737 -25.412751 50.467989)
    (69.607737 153.297975 50.467989)
    (-35.595379 153.297975 50.467989)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (211 358 198) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
